# TODO  Напишите функцию count_letters


# TODO Напишите функцию calculate_frequency






#использовать метод "value" для создания функции по расчёту частоты (смотри методы словарей)




main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

def count_letters(str_):
    dict_of_letters = {}
    DEFAULT_COUNT = 0
    for letter in str_.lower():
        if letter.isalpha():
                dict_of_letters[letter] = dict_of_letters.get(letter, DEFAULT_COUNT) + 1
    return dict_of_letters


def calculate_frequency(dict_):
    sum_of_values = sum(dict_.values())
    for letter in dict_:
        dict_[letter] = round(dict_[letter] / sum_of_values, 2)
    return dict_

result = calculate_frequency(count_letters(main_str))

for letter, frequency in result.items():
    print(f"{letter}: {frequency:.2f}")



# TODO Распечатайте в столбик букву и её частоту в тексте
